## 결측치 표현
### NaN / None으로 표현(Nan: float64, None: 파이썬 내장 객체)

In [93]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## 결측치 표현 및 확인

In [94]:
float_data = Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [95]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [96]:
float_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

## 결측치 골라내기(dropna)

In [97]:
data = Series([1, np.nan, 3.5, np.nan, 7])

In [98]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [99]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [100]:
data[data.notna()]  # 불리언 객체를 이용한 색인

0    1.0
2    3.5
4    7.0
dtype: float64

In [101]:
data = DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                  [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [102]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [103]:
data.dropna()   # default: how='any' axis='index'

     0    1    2
0  1.0  6.5  3.0

### how

In [104]:
data.dropna(how="all")  # 모든 데이터가 결측치일 때만 삭제

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

### axis

In [105]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [106]:
data.dropna(axis="columns", how="any")

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

### thresh

In [107]:
df = DataFrame(np.random.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan

In [108]:
df

          0         1         2
0  1.386473       NaN       NaN
1  0.492655       NaN       NaN
2  0.379107       NaN -0.664696
3  0.520901       NaN  0.304202
4  1.495782  0.379613 -0.306081
5 -0.236156  0.086061  0.540220
6  0.427885 -1.213598 -1.577030

In [109]:
df.dropna()

          0         1         2
4  1.495782  0.379613 -0.306081
5 -0.236156  0.086061  0.540220
6  0.427885 -1.213598 -1.577030

In [110]:
df.dropna(thresh=2) # 결측치가 thresh의 개수보다 적은 개수를 반환

          0         1         2
2  0.379107       NaN -0.664696
3  0.520901       NaN  0.304202
4  1.495782  0.379613 -0.306081
5 -0.236156  0.086061  0.540220
6  0.427885 -1.213598 -1.577030

## 결측치 채우기(fillna)

In [111]:
df

          0         1         2
0  1.386473       NaN       NaN
1  0.492655       NaN       NaN
2  0.379107       NaN -0.664696
3  0.520901       NaN  0.304202
4  1.495782  0.379613 -0.306081
5 -0.236156  0.086061  0.540220
6  0.427885 -1.213598 -1.577030

In [112]:
df.fillna(0)    # 결측치를 0으로 채워줌

          0         1         2
0  1.386473  0.000000  0.000000
1  0.492655  0.000000  0.000000
2  0.379107  0.000000 -0.664696
3  0.520901  0.000000  0.304202
4  1.495782  0.379613 -0.306081
5 -0.236156  0.086061  0.540220
6  0.427885 -1.213598 -1.577030

### 딕셔너리를 통한 결측치 채우기

In [113]:
df.fillna({1: 0.5, 2: 0})   # feature 별로 다른 결측치

          0         1         2
0  1.386473  0.500000  0.000000
1  0.492655  0.500000  0.000000
2  0.379107  0.500000 -0.664696
3  0.520901  0.500000  0.304202
4  1.495782  0.379613 -0.306081
5 -0.236156  0.086061  0.540220
6  0.427885 -1.213598 -1.577030

### method
reindex 할 때 결측치가 많이 발생함 -> 결측치를 채우기 위해서 method 사용 가능한 것처럼
DataFrame에서도 사용 가능

In [114]:
df = DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan

In [115]:
df

          0         1         2
0 -0.455076  0.947608 -1.190281
1 -0.922790  0.312481  0.704425
2 -1.135760       NaN  2.913574
3  3.383234       NaN  0.712350
4  0.890219       NaN       NaN
5 -0.404441       NaN       NaN

In [116]:
df.fillna(method="ffill")   ## 전의 값으로 채워줌

C:\Users\hello\AppData\Local\Temp\ipykernel_14344\3665968059.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")   ## 전의 값으로 채워줌

          0         1         2
0 -0.455076  0.947608 -1.190281
1 -0.922790  0.312481  0.704425
2 -1.135760  0.312481  2.913574
3  3.383234  0.312481  0.712350
4  0.890219  0.312481  0.712350
5 -0.404441  0.312481  0.712350

In [117]:
df.fillna(method="ffill", limit=2)  # limit: 결측치를 채울 개수 조정 가능

C:\Users\hello\AppData\Local\Temp\ipykernel_14344\739359190.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill", limit=2)  # limit: 결측치를 채울 개수 조정 가능

          0         1         2
0 -0.455076  0.947608 -1.190281
1 -0.922790  0.312481  0.704425
2 -1.135760  0.312481  2.913574
3  3.383234  0.312481  0.712350
4  0.890219       NaN  0.712350
5 -0.404441       NaN  0.712350

In [118]:
data = Series([1., np.nan, 3.5, np.nan, 7.])

In [119]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [120]:
data.fillna(data.mean())    # 결측치를 평균으로 채워줌

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 데이터 변형
## 함수나 매핑을 이용하여 데이터 변형

In [121]:
data = DataFrame({"food": ["bacon", "pulled pork", "bacon",
                           "pastrami", "corned beef", "bacon",
                           "pastrami", "honey ham", "nova lox"],
                    "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [122]:
data    # DataFrame 요소 별 적용: applymap

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [123]:
# 매핑 할 딕셔너리 생성
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [124]:
# data["food"]만 가져왔으므로 Series 형태 -> map 이용
data["animal"] = data["food"].map(meat_to_animal)

In [125]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [126]:
def get_animal(x):
    return meat_to_animal[x]

In [127]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [128]:
df = DataFrame(np.random.standard_normal((7, 3)))

In [129]:
df

          0         1         2
0  0.585798  1.469269 -0.978207
1  1.500349 -0.353744  0.745571
2 -0.603815  0.582076 -0.482477
3  2.612555  0.484618  0.966260
4 -1.173912 -1.369536 -0.521261
5  0.470686 -0.657345  0.865581
6  0.357737  0.608617 -0.745924

In [130]:
df.applymap(lambda x: x**2)

C:\Users\hello\AppData\Local\Temp\ipykernel_14344\1911323247.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: x**2)

          0         1         2
0  0.343160  2.158750  0.956889
1  2.251046  0.125135  0.555877
2  0.364593  0.338813  0.232784
3  6.825445  0.234854  0.933658
4  1.378069  1.875628  0.271713
5  0.221545  0.432102  0.749231
6  0.127976  0.370415  0.556402

## 값 치환하기

### replace

In [131]:
data = Series([1., -999., 2., -999., -1000., 3.])

In [132]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [133]:
data.replace(-999, np.nan)  # replace(바꾸고 싶은 값, 바꿀 값)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [134]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 축 색인 이름 바꾸기
- map이나 rename 이용하여 변경 가능

### map

In [135]:
data = DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [136]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [137]:
def transform(x):
    return x[:4].upper()

In [138]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [139]:
data.index = data.index.map(transform)

In [140]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### rename

In [141]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [142]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [143]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## 이산화
- 연속적인 데이터를 이산적 데이터로 분할
- 분석을 위해 그룹으로 나눔

### cut, qcut < 중요!!
- pd.cut(x, bins, labels, right)
- x: 이산화 하기 위한 Series/리스트
- bins: 범위값을 나타냄
- labels: 이산화 된 데이터를 부를 이름
- right: 오른쪽에 포함/왼쪽에 포함

### cut

In [144]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [145]:
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [146]:
pd.cut(ages, bins, right=False) # 우측 값 포함 x -> 다음 그룹으로 넘어감

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [147]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

### qcut

In [148]:
data = np.random.standard_normal(1000)

In [149]:
data

array([ 1.70469779e+00,  2.47911553e-01, -8.74770005e-01, -9.18362568e-01,
       -4.76028717e-01, -2.62574537e-01, -7.93844250e-01,  4.15965177e-01,
        1.51630302e+00,  9.91633092e-01,  2.36854928e-01, -7.64214956e-01,
       -3.56666804e-02,  3.51022160e-01,  1.94318854e-01, -1.13449848e+00,
       -4.85673463e-02, -8.25763986e-01, -4.72209320e-01, -2.15221923e+00,
        8.26245862e-01,  2.45587380e-01, -1.08837910e+00, -8.18370437e-01,
       -2.27638351e+00, -1.81882729e+00, -2.93613961e-01, -1.84684737e+00,
        7.65680476e-01, -3.47501366e-01,  1.15776985e+00,  1.18814979e+00,
       -1.58067539e+00, -1.85795858e+00,  1.61421658e+00,  1.27268674e+00,
        1.29904346e-01,  1.02027029e+00, -2.38815046e+00, -4.60566142e-01,
       -3.17688709e-01,  4.86227157e-01,  1.49937937e+00, -2.00341486e-02,
       -5.83449335e-01,  1.86043378e+00, -1.46028335e+00,  6.15843191e-01,
       -7.44190368e-01,  2.20461402e-01, -1.10059155e+00,  8.55581972e-01,
        1.22935863e+00,  2.82257408e-01,  6.24250139e-01, -5.87232945e-01,
       -1.76026935e+00,  6.69196464e-01,  8.44230586e-02,  7.17565138e-01,
        2.50464333e-01,  2.12841293e+00, -2.37754777e+00, -1.34722926e+00,
        2.70142024e-01,  5.27653528e-01,  1.08694363e-01,  1.27594693e+00,
       -6.75432726e-01,  1.72200728e+00, -4.79199805e-02,  7.03251256e-02,
        6.30128372e-01, -8.93311071e-02,  1.27684382e+00,  1.66540249e+00,
       -6.06496610e-02, -2.21611968e+00, -7.85052487e-02,  1.41426071e+00,
        1.71486711e+00, -1.10141214e+00,  1.88487225e+00,  1.19799982e-01,
       -1.05784661e+00,  4.04105323e-01,  1.03255233e-01,  4.95300690e-01,
        1.40603272e-02,  5.30384729e-01, -1.96936728e-01,  1.25639070e+00,
       -8.51405701e-01, -1.60171321e+00,  2.82842865e+00,  1.00795487e+00,
       -1.51806862e+00,  1.19705536e+00,  7.34108642e-01, -4.45481485e-01,
        3.99330276e-02, -2.45512332e-01,  3.20402948e-01,  1.51113501e+00,
        5.51133916e-01, -9.54321590e-01,  4.99505277e-01, -6.51962983e-01,
        5.84244221e-01, -6.73444159e-02,  1.30057136e+00,  1.51016955e+00,
       -7.23904355e-01,  5.32070124e-01, -6.81858173e-01, -2.59232493e+00,
        8.76791028e-01, -4.72530963e-01,  1.42901841e+00, -1.30130510e+00,
       -7.91196381e-01,  3.45359119e-01, -1.66703310e+00, -8.91825755e-01,
        4.65774230e-01,  7.21942781e-01, -1.03182727e+00,  5.64872487e-01,
       -7.01455818e-01, -5.22652465e-01,  6.66289791e-01,  1.43743505e+00,
       -3.93641017e-01,  1.92262527e-01,  1.28307882e+00, -2.25595819e+00,
       -1.62521081e+00, -5.95922525e-01,  3.46498231e-01, -9.27120476e-01,
        9.92459290e-01, -1.83922521e+00,  1.35561523e+00,  5.81253064e-01,
        1.39695340e-01, -6.64758012e-01, -2.26950708e+00, -1.00431247e+00,
        2.25624318e+00, -2.76871625e-01,  8.40055533e-01, -1.77833949e+00,
       -3.62719905e-02,  1.39454003e+00,  7.95382817e-01, -2.45953881e+00,
        3.20720820e-01, -5.30768290e-01, -1.15211833e+00, -8.91569227e-01,
        8.01316516e-01, -6.79155997e-01,  2.43112505e-01,  3.89284711e-01,
       -6.43207001e-01,  2.44051264e-01, -1.86259828e+00, -4.01542743e-01,
       -2.46020121e-01,  7.70154331e-01,  8.10838517e-01, -1.33917225e+00,
        1.19327281e+00, -1.55192790e+00, -1.93680175e+00,  1.89482026e+00,
       -1.54692099e+00,  7.55088502e-01,  1.02702223e+00,  8.78415471e-01,
        2.94509588e-01,  8.19340394e-01, -5.08327361e-01,  1.27106984e-01,
        8.52159171e-01,  1.39978883e+00,  1.40437854e-01,  4.11699794e-01,
       -1.05184238e+00,  3.52055439e-01,  6.76664892e-01, -3.48385066e-01,
        2.82675773e-01, -4.51957614e-01, -5.67812775e-01, -9.76999827e-01,
        1.83319335e+00,  7.89747257e-01,  1.81567791e-01, -6.61374612e-01,
        5.19703519e-02,  9.25866169e-01, -1.43023633e+00,  1.32670254e+00,
       -1.86525820e+00,  4.94966949e-02,  2.73312670e-02, -9.19528443e-01,
        2.72898032e-01,  9.90394883e-01,  8.14004556e-02, -1.49277616e-01,
       -1.40571258e+00, -1.64326000e-01,  5.85940051e-01, -5.47621940e-01,
        2.63866201e-01,  1.22138668e+00, -3.69050433e-01,  1.31409523e-01,
       -2.73097891e-01,  4.49836424e-01,  1.59600337e-01,  6.24307373e-01,
       -4.67037157e-01, -9.50738220e-02,  5.02454669e-01, -4.28549549e-01,
       -7.48173673e-01, -3.78474817e-01, -1.34107512e+00,  7.45293832e-01,
        1.19877111e+00,  2.93923962e-02,  1.48367592e-01,  2.04211479e-01,
       -7.95036670e-01, -1.03305074e-01, -1.57226711e+00,  1.01251803e+00,
       -1.25476438e+00, -1.00510866e+00,  4.47141631e-02,  2.33343577e+00,
       -2.29572155e-01, -1.63364141e+00,  2.48068265e-01,  3.89004295e-01,
        9.81880381e-01, -1.53530156e-01, -5.93027889e-01,  9.31602571e-01,
        5.00480055e-01,  1.56550295e-01, -1.93985457e+00, -1.15215655e+00,
       -1.79743513e+00,  1.62451997e+00, -1.49827420e-01,  1.64231359e-01,
        1.45707238e+00,  1.22054470e+00, -3.96103877e-01, -1.07177020e+00,
        8.20736899e-01,  1.13389617e-01, -4.37594028e-01, -9.89356420e-01,
        1.14408263e+00,  2.11021392e+00, -1.25839822e-01, -4.72364740e-01,
       -4.63620082e-01,  9.71030326e-01, -5.98318486e-01,  5.62407443e-01,
       -5.21323626e-01,  1.74702563e+00, -4.77141231e-01, -6.28710823e-01,
       -4.06603871e-01, -3.09667261e-01, -8.83277364e-01,  9.63696685e-01,
        3.40998668e-01, -5.52632300e-01,  9.29238544e-01,  1.75573806e+00,
       -1.45753281e+00,  9.14349969e-01,  5.11049254e-01, -5.21400891e-01,
        1.24441112e+00,  2.01439440e-01, -7.23503333e-01,  1.13929035e+00,
        4.12729475e-01,  9.73147250e-01, -3.92921362e-01,  9.56859771e-01,
        2.27328742e+00, -9.72688057e-01, -1.49795238e+00,  7.84591803e-01,
       -1.86161217e-01, -4.65328253e-01,  7.98398758e-01, -1.34334086e-01,
       -2.51358261e-02,  3.50846047e-01,  3.76672642e-01,  1.31818779e-01,
        4.39484810e-01, -9.93659500e-02, -1.78513550e-01,  1.16268863e+00,
        1.02823623e+00, -1.36138029e+00,  3.08885961e-01,  1.78185185e-01,
       -8.25522820e-02, -3.88842779e-01,  1.91518692e+00,  5.66737706e-01,
       -3.75906520e-01,  1.37384818e-01, -2.81061253e-01,  1.46464625e+00,
        5.05011083e-01, -2.24269475e-01, -8.63236277e-01,  1.24596219e+00,
       -5.69798884e-01,  7.37704208e-01, -2.92580846e-01, -1.40732417e-01,
        5.51180311e-01,  5.61814802e-01, -4.71501539e-01,  7.38111860e-01,
       -1.70725046e+00,  6.81785349e-01,  6.00454799e-01, -2.83709553e-01,
        2.24902618e-01,  3.26632780e-01,  2.65420348e-01, -1.12444549e+00,
       -1.24469488e+00, -2.82225202e+00, -1.95389333e+00, -5.94521292e-01,
       -1.34285670e+00,  2.32498617e+00, -1.12971582e+00,  1.62152836e+00,
        2.07540384e+00, -2.40764188e-01, -1.58861010e+00, -3.49716677e-01,
        6.66484811e-01,  6.23115129e-01, -3.28205427e-01,  1.33354379e+00,
       -9.38984979e-01,  2.27377764e-01,  7.16897465e-02, -1.27113261e+00,
        2.70714974e-01, -9.38525735e-01,  3.38339978e-01, -8.17643097e-01,
       -3.28348524e-01,  1.04230735e+00, -1.35170457e+00, -1.51297391e+00,
       -9.65406206e-01, -5.41302152e-01, -2.03709655e+00,  1.22503816e-01,
        2.67512678e-01, -1.04378976e+00, -1.10571790e+00,  4.93935966e-01,
        1.58285063e+00,  1.23019004e+00,  1.35901252e+00, -3.89899792e-01,
        4.57761620e-01, -1.34888167e+00, -5.58192793e-01,  1.81111974e-02,
       -6.16243277e-01,  2.78655713e+00, -6.86556102e-01,  3.61542419e-01,
       -3.60407296e+00,  4.30310492e-01, -1.22716067e+00, -1.99300908e+00,
        2.07326520e-01,  8.59716614e-01,  1.49741882e+00,  2.19860140e+00,
       -7.60732704e-01, -1.36282269e+00, -1.08920988e+00,  3.75727120e-01,
        3.78870261e-01, -4.24528390e-01,  4.08148876e-01, -8.51796170e-01,
       -2.72549250e-01, -3.74120564e-01, -1.30316345e+00,  1.02722091e+00,
        5.51878036e-01,  6.57625687e-01,  4.89570139e-01, -1.63306222e+00,
        1.48568248e+00, -1.19685716e+00, -6.12083481e-01, -3.53941895e-01,
        1.01409663e+00, -2.04670443e+00,  1.80893836e+00, -1.21909963e+00,
       -5.25693948e-01, -1.52101954e-01, -8.23881068e-01,  1.29367279e-01,
       -5.26301553e-01,  2.73104141e+00,  1.32694039e+00, -7.61447340e-01,
        2.59360651e-01,  1.06998227e+00,  1.53504838e+00,  3.96111080e-02,
       -3.69415632e-01, -9.66516496e-01, -6.41232946e-01, -6.78643131e-01,
        2.04592908e+00,  4.59839231e-01,  1.15223860e+00, -2.75964396e-01,
        1.34553240e-01, -4.88539250e-01, -2.25966206e-01, -5.38971735e-02,
        9.82534727e-01, -4.04857902e-01, -1.13256270e+00, -7.40653362e-01,
        1.27207706e-01, -1.95736363e+00, -1.13908529e+00,  1.82626149e+00,
        2.42438339e+00,  2.43993799e+00,  6.81127292e-01, -1.81493541e+00,
       -1.99864473e-01, -4.23902684e-01, -4.02987471e-01,  2.45020184e-01,
        5.44261692e-01,  1.09333350e+00,  8.45629437e-01, -1.19107761e-02,
        5.79891175e-01,  1.51484493e+00, -3.50451739e-02,  1.41014650e+00,
       -7.46718639e-02, -1.03995682e+00,  5.61932233e-01,  1.41767711e+00,
       -1.47067451e-01, -4.74786657e-01,  2.30532164e+00, -1.04935376e+00,
        5.55008010e-01, -5.49002695e-01, -2.05327009e-01, -1.11685750e+00,
       -8.08611398e-02, -2.57410653e-01,  9.12222677e-01, -1.66882937e+00,
        1.26025975e+00, -1.56322854e-01, -9.89554470e-02,  1.19313936e+00,
       -2.00332985e-01, -1.16400441e-01, -1.71414375e+00,  9.70700920e-01,
        4.38025298e-01, -5.55710833e-01,  8.15765934e-01,  5.50291776e-01,
       -1.98867230e+00, -1.88812640e-01, -1.86205673e-01, -9.87238132e-01,
       -1.60197236e-01, -1.28149269e+00, -9.42106570e-01, -4.57910347e-01,
        8.00456535e-01, -1.05628237e+00, -2.43619261e+00,  1.76613385e+00,
        1.32564448e+00,  7.66206517e-01, -8.04334079e-01, -1.38881683e+00,
       -1.03578953e+00,  2.14629929e-01, -1.63594684e+00,  1.29931939e+00,
       -3.52398862e-01,  1.69672080e+00, -1.27809392e-02,  8.47101976e-01,
        8.25312286e-01, -7.31539985e-01, -1.23438832e+00, -1.81141562e-01,
        5.71215086e-01,  5.00911756e-01, -1.20296098e+00, -1.19500332e+00,
       -5.31079757e-01,  1.02797295e+00, -2.13534039e-01,  1.56061549e+00,
        9.71981475e-01,  1.64903747e+00,  9.91912716e-01, -9.92180078e-01,
       -2.08189426e-01,  7.27769632e-01,  6.24012853e-01,  2.40193877e-02,
        2.03219834e-02, -2.76826901e-01,  5.31687082e-01, -2.57251048e-01,
        2.19994025e+00, -4.03186135e-01,  7.46173209e-01,  8.16290714e-02,
        3.07025357e-01,  1.90074042e+00, -1.21391991e+00, -2.18902143e-01,
       -5.97830336e-01, -1.75153344e-01, -7.88495294e-02, -1.09315131e+00,
       -7.38265125e-01, -1.19706138e+00,  1.65560676e+00, -9.28207143e-01,
        5.10829151e-01, -8.91546480e-01, -4.74474328e-01,  1.16277460e+00,
        1.21762494e+00,  1.20858317e+00,  2.39298889e+00,  2.66841919e-02,
        1.77289188e+00, -1.30577171e+00,  4.69540447e-01, -1.49116253e+00,
        4.80186626e-01,  6.84335972e-01, -2.22699891e+00,  6.72887015e-01,
       -7.08140612e-01, -1.01424109e+00,  2.33360760e+00, -6.59252818e-01,
        1.85950182e+00,  1.89217599e+00,  2.00052504e-01, -4.46060889e-01,
        2.85976683e-01, -4.00373823e-01, -5.07945292e-01, -7.11895350e-01,
        1.32577836e+00,  1.85299366e+00, -2.08768837e+00, -1.52187306e+00,
       -2.16131786e+00,  1.96706561e+00, -6.81217380e-01,  1.34467103e+00,
        4.29709281e-01,  7.44466705e-01,  2.74190856e-01,  7.59611213e-01,
       -3.50735320e-01,  1.15342143e+00, -1.77564127e+00,  7.66324530e-01,
        1.18512328e+00, -2.23004775e-01, -1.98950038e+00,  3.61701320e-01,
       -5.88987869e-01,  1.09835834e+00,  6.17838588e-02, -2.52375138e-01,
       -3.21258255e-01,  3.82558113e-03,  1.46178251e-01,  6.76737797e-02,
        8.82968791e-01, -7.13625221e-01, -1.34066981e+00,  1.02771497e+00,
       -1.03915470e+00, -4.69949109e-01,  1.75152048e-01, -3.59302285e-01,
        8.25543468e-01, -8.70064816e-01, -1.86408262e+00,  1.86117060e+00,
       -7.52410657e-01, -1.15612642e+00,  5.08213696e-01,  2.49951663e-01,
        1.38663542e-01,  3.82943267e-01,  4.05137086e-01, -1.77651252e+00,
       -6.35883202e-01,  2.19288989e+00,  3.85722210e-01,  3.76392368e-01,
       -6.10810064e-01,  2.03990258e-01, -1.01996426e+00,  5.17542437e-01,
       -4.31153481e-01,  1.15145089e+00, -2.42118651e-01, -1.23101553e+00,
       -2.86006925e+00, -2.27640009e-01,  6.58127745e-01,  4.21453090e-01,
        2.39855854e+00, -2.12960058e+00, -3.56280267e-01,  6.12938857e-01,
        1.25113154e+00, -4.10307803e-01, -1.34745993e+00,  3.50876327e-01,
       -6.03855136e-01, -2.38086588e-01, -1.49796898e-01,  2.63041827e-01,
       -5.16119168e-01, -2.62606243e+00, -7.56207065e-01,  4.53052306e-01,
       -4.65906312e-01, -4.82356425e-01,  1.15908035e+00,  2.32181722e-01,
        7.01419266e-01, -1.00775076e+00,  2.30684812e-01, -6.22489774e-01,
        2.21474172e-01,  3.82119944e-01,  6.73310625e-01, -1.38140777e+00,
       -9.78230486e-01,  1.57675224e+00,  2.45215280e-01, -1.76372360e-01,
       -1.62762648e+00, -3.58627040e-01, -1.09901502e-02, -1.28957481e+00,
        1.03865190e+00,  1.35216347e-01,  5.14866072e-01,  5.01024091e-02,
       -2.36419707e-01,  1.49131493e-02,  1.12803659e+00,  1.42185668e+00,
        1.10301013e+00, -1.24869515e-01,  4.85893226e-01,  1.89431100e+00,
        2.45875153e+00, -9.93936790e-02, -7.80879864e-02, -1.56439103e+00,
       -1.88324170e+00, -6.81644917e-01, -4.13229678e-01,  4.41225885e-01,
       -4.25493743e-01, -1.00695336e+00,  5.88357138e-01, -6.90044640e-01,
       -1.93248125e+00,  7.71211087e-03, -6.44599646e-01,  2.69781985e-01,
        1.17828373e+00,  5.97976858e-02, -7.39789556e-01,  3.65447115e-01,
       -5.67765846e-01,  1.05610460e-01,  1.44942610e+00,  1.40651829e-01,
       -1.77174742e+00, -3.19715241e-01, -2.00210595e+00,  3.34033573e-01,
        4.96028122e-01,  1.29959276e+00, -1.93813322e-01, -1.08642863e+00,
        3.75399689e-01, -2.12477822e+00,  1.38935784e+00, -8.92725552e-01,
        4.21759499e-02, -5.82691901e-01,  9.20504620e-01, -1.45286846e+00,
        7.48175185e-01,  2.44348282e-01, -2.85638221e-01,  8.22653115e-02,
       -2.01359759e+00,  9.35951011e-01, -7.45628029e-01, -1.05526968e-01,
        1.08928048e+00, -7.02693444e-01,  7.01737686e-01,  4.12018084e-01,
        6.31402582e-01, -5.90072946e-01,  1.08745439e+00,  2.18862014e+00,
       -2.49411940e+00, -1.40248917e+00, -1.04907856e+00, -2.08611951e-01,
        1.00193990e+00, -2.58396975e-01, -5.73263849e-01,  8.65429017e-01,
        3.78378629e-01,  5.24218322e-01,  1.33491451e+00, -7.56075614e-01,
       -1.86174515e-01,  1.93594675e-01,  5.04637396e-01,  1.62826462e+00,
        6.59678098e-01, -1.65481627e-01, -2.77865566e-01, -1.19783033e+00,
       -2.14128303e-01, -8.27857278e-01,  8.88919193e-01,  1.12603843e+00,
        1.31890945e+00,  1.43096879e+00,  1.83504500e+00,  2.66856869e-01,
       -4.51855323e-01, -1.38855645e-01, -1.37678087e+00, -1.05557536e+00,
        2.62181618e-01, -2.02898879e-01, -2.17435393e+00, -8.95071423e-01,
       -5.05973309e-01,  8.27292706e-02,  6.26712112e-01,  8.20345871e-01,
        3.71192694e-01, -2.45318113e+00,  8.84440839e-01,  1.04802675e+00,
        8.56402057e-01, -4.69120233e-01, -2.42053154e+00,  2.41236174e+00,
        4.94387129e-01, -7.92117565e-01,  6.31000880e-01,  5.77827080e-02,
       -3.50640700e-01,  1.15784101e+00,  3.27697939e-01,  1.80672270e-01,
       -5.03165226e-01, -2.11061651e+00,  8.93643136e-02, -7.28819488e-01,
        7.85682534e-01,  9.12189525e-01,  6.57515159e-01,  6.44808880e-01,
        1.44637710e+00, -6.95072358e-01,  1.05889818e+00,  9.14753040e-01,
       -2.74914968e-01, -5.86168869e-01, -1.44384783e+00,  3.35991310e-01,
        4.08586956e-01,  1.78660445e+00, -3.19827311e-01,  3.20446383e-01,
       -1.09230930e+00, -1.29707617e+00, -1.01499451e-01,  2.81336456e-01,
       -5.47873070e-01,  1.09771665e+00,  1.89229414e+00,  8.74089548e-01,
        3.54870155e-01, -1.64045675e+00, -1.87347406e+00,  5.96326194e-01,
       -2.66745622e-01, -2.19433873e-01,  1.36340815e+00, -5.82278167e-01,
        8.96813095e-01,  1.22839642e+00,  1.06736869e+00,  1.09261976e+00,
       -3.08617260e-01, -8.59096958e-01,  3.41999493e-01,  1.41695726e+00,
       -8.70619958e-01, -1.86139650e+00,  3.61364247e-01, -2.51088646e-01,
        1.61612938e+00, -1.51402990e+00, -8.43405223e-01,  1.14642142e+00,
       -6.52116256e-01,  7.55532549e-01, -8.92477083e-01, -3.85265593e-01,
        3.75721386e-01, -1.30008015e+00,  6.02895959e-01,  8.83505210e-01,
       -2.52862231e-01, -1.92457350e+00,  4.56473143e-01,  6.23858495e-01,
       -5.22136227e-02,  1.00739080e+00, -7.48569958e-01, -8.17749442e-01,
        9.98404278e-02,  3.36521614e-01, -1.21781439e-01,  6.47538981e-01,
        1.12948145e-01, -2.53071864e-01, -6.13656732e-01,  5.30854054e-01,
        9.38643783e-01, -2.18356245e-02, -1.23774470e+00,  5.71574475e-01,
       -1.05287116e+00,  3.22455381e-01,  3.31770588e-02, -6.10790347e-01,
        1.86671512e+00,  8.83205848e-01, -1.28356777e-01,  1.91344619e+00,
       -1.20109236e+00,  2.06079763e+00,  1.13721733e+00, -1.51046909e+00,
        1.41771559e+00,  4.53999043e-01,  1.02027675e+00,  1.53159978e-01,
        2.42902871e-01, -3.32366154e-01, -3.47230860e-01,  1.07177272e+00,
       -1.15085176e+00, -4.45904935e-01, -5.79706438e-01,  1.78306899e+00,
        4.29461988e-01, -1.00352205e+00,  1.80287964e+00,  2.56405372e+00,
        5.79991086e-01, -1.97169412e+00,  7.01980223e-01, -2.03503047e+00,
       -4.64886227e-01, -1.46773500e+00, -1.12998999e+00, -1.21818412e+00,
        1.03091817e+00,  9.09375804e-01,  6.83741153e-01,  1.14280436e+00,
       -2.56423849e-01, -1.15656481e+00,  7.80398224e-01,  3.74791159e-01,
       -1.19619258e-01,  9.95920786e-01, -3.05070805e-01,  9.91600277e-01,
        1.12158697e+00, -8.67485118e-01,  8.24994336e-01, -1.15246563e-01,
        1.62553063e-01,  1.48495601e+00,  1.19751266e+00,  3.10269060e-01,
        2.37360028e-01,  2.09470182e+00, -5.62455387e-01, -4.55505493e-01,
        3.05378115e-01, -2.49910282e-01,  8.52342006e-01,  5.43179822e-01,
        2.28404453e-01,  3.70901273e-01, -1.19506030e+00,  1.20827968e+00,
       -1.39132312e+00,  3.46049695e-01, -2.04555518e-02, -1.46950721e-03,
        2.32484011e-01, -3.54822911e-01,  1.62551220e+00, -6.36421999e-01,
       -1.06157797e+00, -1.79643077e+00,  7.85351023e-01, -1.88087771e-01,
        1.18491581e+00,  9.92022989e-01,  1.11790521e+00,  1.61046155e+00,
       -3.78414933e-01,  5.42698544e-01, -3.58783509e-02, -1.12591857e+00,
       -3.06165550e+00,  3.20370872e-01,  2.36157546e+00, -6.62713769e-01,
       -2.25908070e+00,  7.72769606e-01, -7.55824860e-01,  1.39872176e-01,
        6.35655923e-01,  1.35698015e-02, -9.28030666e-01, -8.23216694e-01])

In [150]:
# 균등한 길이의 그룹을 계산
quartiles = pd.qcut(data, 4, precision=2)   # precision: 정밀도, 소숫점 아래 자리
quartiles

[(0.75, 2.83], (0.047, 0.75], (-3.61, -0.66], (-3.61, -0.66], (-0.66, 0.047], ..., (0.047, 0.75], (0.047, 0.75], (-0.66, 0.047], (-3.61, -0.66], (-3.61, -0.66]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.61, -0.66] < (-0.66, 0.047] < (0.047, 0.75] < (0.75, 2.83]]

In [151]:
pd.value_counts(quartiles)

C:\Users\hello\AppData\Local\Temp\ipykernel_14344\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.61, -0.66]    250
(-0.66, 0.047]    250
(0.047, 0.75]     250
(0.75, 2.83]      250
Name: count, dtype: int64

In [152]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.605, -1.347]    100
(-1.347, 0.0471]    400
(0.0471, 1.328]     400
(1.328, 2.828]      100
Name: count, dtype: int64

## 이상치를 찾고 제외하기

### 이상치(outlier)
- 전체적인 데이터 분포에서 크게 어긋나는 값

In [153]:
data = DataFrame(np.random.standard_normal((1000, 4)))

In [154]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.031794     0.041854    -0.023596    -0.062169
std       0.984904     1.023084     0.961195     1.007605
min      -3.447699    -3.470345    -3.367867    -3.003550
25%      -0.645498    -0.611842    -0.718572    -0.756093
50%       0.040907     0.065907    -0.005397    -0.060770
75%       0.681537     0.709649     0.672906     0.662103
max       3.291229     3.009082     2.844765     2.938530

In [155]:
data.abs() > 3

         0      1      2      3
0    False  False  False  False
1    False   True  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [156]:
(data.abs() > 3).any(axis="columns")    # 이상치가 하나라도 있는 data 호출

0      False
1       True
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [157]:
np.sum((data.abs() > 3).any(axis="columns"))

10

In [158]:
# 이상치가 아닌 데이터만 호출
data.loc[~(data.abs() > 3).any(axis="columns"), :]

            0         1         2         3
0    0.201442  0.701887 -2.293438 -0.665062
2    0.902864  0.185102 -0.421994 -0.430550
3   -1.555945 -0.154667 -0.018161  0.751779
4    1.121325 -1.690081  0.162160 -0.687592
5    2.640220 -2.279314 -2.428916 -0.899287
..        ...       ...       ...       ...
995 -0.860771  2.015465  0.914827  0.468130
996  0.678318  1.492406 -2.290447 -2.322196
997 -0.839412  0.584311 -2.538450  0.819146
998 -1.154956 -0.451763 -0.230803  1.217539
999 -0.241318 -1.269809 -0.717520 -0.197173

[990 rows x 4 columns]

In [159]:
data.index[(data.abs() > 3).any(axis="columns")]

Index([1, 165, 204, 231, 473, 671, 705, 882, 933, 978], dtype='int64')

In [160]:
# 이상치가 있는 데이터 제거
data.drop(data.loc[(data.abs() > 3).any(axis="columns")])

            0         1         2         3
4    1.121325 -1.690081  0.162160 -0.687592
5    2.640220 -2.279314 -2.428916 -0.899287
6    0.312106  0.182112  1.067853  1.145427
7    0.524619 -0.385566  0.421246  0.807983
8    0.485148  0.022015  0.833501  0.813697
..        ...       ...       ...       ...
995 -0.860771  2.015465  0.914827  0.468130
996  0.678318  1.492406 -2.290447 -2.322196
997 -0.839412  0.584311 -2.538450  0.819146
998 -1.154956 -0.451763 -0.230803  1.217539
999 -0.241318 -1.269809 -0.717520 -0.197173

[996 rows x 4 columns]

In [161]:
np.sign(data) * 3

       0    1    2    3
0    3.0  3.0 -3.0 -3.0
1    3.0 -3.0  3.0 -3.0
2    3.0  3.0 -3.0 -3.0
3   -3.0 -3.0 -3.0  3.0
4    3.0 -3.0  3.0 -3.0
..   ...  ...  ...  ...
995 -3.0  3.0  3.0  3.0
996  3.0  3.0 -3.0 -3.0
997 -3.0  3.0 -3.0  3.0
998 -3.0 -3.0 -3.0  3.0
999 -3.0 -3.0 -3.0 -3.0

[1000 rows x 4 columns]

In [162]:
data[data.abs() > 3] = np.sign(data) * 3

In [163]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.031930     0.042653    -0.023228    -0.062166
std       0.982436     1.020521     0.959983     1.007594
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.645498    -0.611842    -0.718572    -0.756093
50%       0.040907     0.065907    -0.005397    -0.060770
75%       0.681537     0.709649     0.672906     0.662103
max       3.000000     3.000000     2.844765     2.938530

## 표시자, 더미 변수 계산하기
- 더미 변수: 0, 1로 구성된 데이터
- 분류값 -> 더미, 표시자 행렬로 전환
- 통계 모델이나 머신러닝 애플리케이션 개발 적합
- k개의 feature로 확장, 분류값에 따라 0, 1로 나타냄

In [164]:
df = DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                "data1": range(6)})

In [165]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [166]:
# Series에 적용 가능
pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [167]:
# default 값은 boolean
pd.get_dummies(df["key"])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [168]:
# prefix로 feature 이름 조정 가능
dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)

In [169]:
dummies

   key_a  key_b  key_c
0    0.0    1.0    0.0
1    0.0    1.0    0.0
2    1.0    0.0    0.0
3    0.0    0.0    1.0
4    1.0    0.0    0.0
5    0.0    1.0    0.0

In [170]:
# concat: 데이터를 이어붙임
df_with_dummy = pd.concat([df[["data1"]], dummies], axis=1)

In [171]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [172]:
values = np.random.uniform(size=10)

In [173]:
values

array([0.05076514, 0.71574506, 0.00783512, 0.0607942 , 0.33151609,
       0.21778444, 0.98886744, 0.71811569, 0.48272574, 0.66868286])

In [174]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1.]

In [175]:
pd.cut(values, bins, labels=['a', 'b', 'c', 'd', 'e'])

['a', 'd', 'a', 'a', 'b', 'b', 'e', 'd', 'c', 'd']
Categories (5, object): ['a' < 'b' < 'c' < 'd' < 'e']

In [176]:
pd.get_dummies(pd.cut(values, bins, labels=['a', 'b', 'c', 'd', 'e']))

       a      b      c      d      e
0   True  False  False  False  False
1  False  False  False   True  False
2   True  False  False  False  False
3   True  False  False  False  False
4  False   True  False  False  False
5  False   True  False  False  False
6  False  False  False  False   True
7  False  False  False   True  False
8  False  False   True  False  False
9  False  False  False   True  False

In [177]:
pd.get_dummies(pd.cut(values, bins, labels=['a', 'b', 'c', 'd', 'e']), dtype=int)

   a  b  c  d  e
0  1  0  0  0  0
1  0  0  0  1  0
2  1  0  0  0  0
3  1  0  0  0  0
4  0  1  0  0  0
5  0  1  0  0  0
6  0  0  0  0  1
7  0  0  0  1  0
8  0  0  1  0  0
9  0  0  0  1  0

## merge

In [178]:
df1 = DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"],
                 "data1": Series(range(7), dtype="Int64")})
df2 = DataFrame({"key": ["a", "b", "d"],
                 "data2": Series(range(3), dtype="Int64")})

In [179]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [180]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

### 기준이 되는 feature는 기준이 되는 key
option<br>
- on: 사용하여 합칠 key
- left_on, right_on: 각기 서로 다른 key를 기준으로 합침

In [181]:
# key를 기준으로 합침
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [182]:
pd.merge(df1, df2, on="key")

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [183]:
df3 = DataFrame({"lkey": ["b", "b", "a", "c", "a", "a", "b"],
                 "data1": Series(range(7), dtype="Int64")})
df4 = DataFrame({"rkey": ["a", "b", "d"],
                 "data2": Series(range(3), dtype="Int64")})

In [184]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [185]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [186]:
pd.merge(df3, df4, left_on="lkey", right_on="rkey")

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

### how: 병합하는 방식
- inner: 양쪽 테이블 모두에 존재하는 키 조합(교집합)
- left: 왼쪽 테이블에 존재하는 모든 키 조합
- right: 오른쪽 테이블에 존재하는 모든 키 조합
- outer: 양쪽 테이블에 존재하는 모든 키 조합(합집합)

In [187]:
pd.merge(df1, df2, how="outer")

  key  data1  data2
0   a      2      0
1   a      4      0
2   a      5      0
3   b      0      1
4   b      1      1
5   b      6      1
6   c      3   <NA>
7   d   <NA>      2

In [188]:
df1 = DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                 "data1": Series(range(6), dtype="Int64")})
df2 = DataFrame({"key": ["a", "b", "a", "b", "d"],
                 "data2": Series(range(5), dtype="Int64")})

In [189]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [190]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [191]:
pd.merge(df1, df2, on="key", how="left")

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    a      2      0
5    a      2      2
6    c      3   <NA>
7    a      4      0
8    a      4      2
9    b      5      1
10   b      5      3

In [192]:
pd.merge(df1, df2, on="key", how="right")

   key  data1  data2
0    a      2      0
1    a      4      0
2    b      0      1
3    b      1      1
4    b      5      1
5    a      2      2
6    a      4      2
7    b      0      3
8    b      1      3
9    b      5      3
10   d   <NA>      4

In [193]:
pd.merge(df1, df2, how="inner")

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [194]:
left = DataFrame({"key1": ["foo", "foo", "bar"],
                  "key2": ["one", "two", "one"],
                  "lval": Series([1, 2, 3], dtype='Int64')})
right = DataFrame({"key1": ["foo", "foo", "bar", "bar"],
                   "key2": ["one", "one", "one", "two"],
                   "rval": Series([4, 5, 6, 7], dtype='Int64')})

In [195]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [196]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [197]:
# 양쪽 테이블 모두에 존재하는 키 조합 사용(교집합만 추출)
pd.merge(left, right, on=["key1", "key2"], how="inner")

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

In [198]:
# key2_x: df1의 key2, key2_y: df2의 key2
pd.merge(left, right, on="key1")

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [199]:
pd.merge(left, right, on="key1", suffixes=["_left", "_right"])

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [202]:
left1 = DataFrame({"key": ["a", "b", "a", "a", "b", "c"],
                   "value": Series(range(6), dtype="Int64")})
right1 = DataFrame({"group_val": [3.5, 7]}, index=["a", "b"])

In [203]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [204]:
right1

   group_val
a        3.5
b        7.0

In [205]:
pd.merge(left1, right1, left_on="key", right_index=True)

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0

## concat: 데이터를 이어붙임

In [206]:
s1 = Series([0, 1], index=["a", "b"], dtype="Int64")
s2 = Series([2, 3, 4], index=["c", "d", "e"], dtype="Int64")
s3 = Series([5, 6], index=["f", "g"], dtype="Int64")

In [207]:
s1

a    0
b    1
dtype: Int64

In [208]:
s2

c    2
d    3
e    4
dtype: Int64

In [209]:
s3

f    5
g    6
dtype: Int64

In [210]:
# 기본 axis=index(행 방향)
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: Int64

In [211]:
pd.concat([s1, s2, s3], axis="columns")

      0     1     2
a     0  <NA>  <NA>
b     1  <NA>  <NA>
c  <NA>     2  <NA>
d  <NA>     3  <NA>
e  <NA>     4  <NA>
f  <NA>  <NA>     5
g  <NA>  <NA>     6

In [212]:
s4 = pd.concat([s1, s3])

In [213]:
s4

a    0
b    1
f    5
g    6
dtype: Int64